#Вывести на экран ряд чисел 1001,  1004,  1007,  ... 1025.
i = 1001
while i <= 1025:
    print(i,end=" ")
    i = i + 3

