#Выведите следующие строки. Первая: 25  25.5  24.8. Вторая: 26 26.5 25.8.  И так далее. Последняя строка: 35 35.5 34.8.

for i in range(25,36):
    print(i,i + 0.5,i - 0.7)
