#Задача 1
#Есть список a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89].
#Выведите все элементы, которые меньше 5.
a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89,5,2,4]
i = 0
while len(a) > i:
    if a[i] < 5:
        print(a[i])
    i = i + 1
