#Вывести на экран числа 100, 96, 92, ... до последнего положительного включительно.
i = 100
while i != 0:
    print(i, end=' ')
    i = i - 4